<?php

return [
    'name' => [
        'required' => '.حقل اسم الشركة مطلوب',
    ],
    'owner_id' => [
        'required' => '.حقل المدير العام مطلوب',
        'exists' => '. تاكد من ان المدير المختار مدير عام وتاكد من عدم انتماء هذا المدير لشركات اخري',
    ],
    'finance_manager' => [
        'required' => '.حقل المدير المالي مطلوب',
        'exists' => '. تاكد من ان المدير المختار مدير مالي وتاكد من عدم انتماء هذا المدير لشركات اخري',
    ],
    'tax_number' => [
        'required' => '.حقل الرقم الضريبي مطلوب',
        'string' => '.يحب ان يكون حقل الرقم الضريبي نصًا',
        'max' => '.يجب أن لا يتجاوز طول نّص حقل الرقم الضريبي عن :max حرف',
        'unique' => '.قيمة حقل الرقم الضريبي مُستخدمة من قبل',
    ],
    'commercial_register' => [
        'required' => '.حقل السجل التجاري مطلوب',
        'string' => '.يحب ان يكون حقل السجل التجاري نصًا',
        'max' => '.يجب أن لا يتجاوز طول نّص حقل السجل التجاري عن :max حرف',
        'unique' => '.قيمة حقل السجل التجاري مُستخدمة من قبل',
    ],
    'type' => [
        'required' => '.حقل نوع الشركة مطلوب',
        'string' => '.يحب ان يكون حقل نوع الشركة نصًا',
        'in' => '.حقل نوع الشركة المحدد غير موجود',
    ],
];
