<?php

return [
    'name' => [
        'required' => '.حقل اسم المنطقة مطلوب',
        'array' => '.يحب ان يحتوي حقل اسم المنطقة علي عنصر او اكثر',
        'ar' => [
            'required' => '.حقل اسم المنطقة باللغة العربية مطلوب',
            'string' => '.يحب ان يكون حقل اسم المنطقة باللغة العربية نصًا',
        ],
        'en' => [
            'required' => '.حقل اسم المنطقة باللغة الانجليزية مطلوب',
            'string' => '.يحب ان يكون حقل اسم المنطقة باللغة الانجليزية نصًا',
        ],
    ],

];
