<?php

return [
    'slug' => [
        'required' => '.فضلا أكتب اسم الصلاحيه',
        'string' => '.يجب أن يكون حقل البنك نصًا',
        'max' => '.يجب أن لا يتجاوز طول نّص حقل ال slug عن :max حرف',
        'unique' => '.قيمة حقل ال slug مُستخدمة من قبل',
    ],
    'permission' => [
        'required' => '.فضلا أختر الصلاحيات',
        'array' => '.يحب ان يحتوي حقل الصلاحيات علي عنصر او اكثر',
        'unique' => '.قيمة حقل الايبان مُستخدمة من قبل',
        '*' => [
            'string' => '.يجب أن تكون عناصر الصلاحيات نصيه',
            'exists' => 'القيمة المحددة لعناصر الصلاحيات غير موجودة',
        ],
    ],
];
