<?php

return [
    'model_id'=>[
        'required'=>'.حقل المودل مطلوب',
        'int' => '.يجب أن يكون حقل المودل عددًا صحيحًا',
    ],
    'model_type'=>[
        'required'=>'.حقل نوع المودل مطلوب',
        'string' => '.يحب ان يكون حقل نوع المودل نصًا',
    ],
    'banck'=>[
        'required'=>'.حقل البنك مطلوب',
        'int' => '.يجب أن يكون حقل البنك عددًا صحيحًا',
        'exists' => 'القيمة المحددة لحقل البنك غير موجودة'
    ],
    'iban' => [
        'required' => '.حقل الايبان مطلوب',
        'string' => '.يحب ان يكون حقل الايبان نصًا',
        'unique' => '.قيمة حقل الايبان مُستخدمة من قبل'
    ]
];
