<?php

return [
    'validation' => [
        'identification_number' => [
            'required' => '.حقل رقم الهوية مطلوب',
            'integer' => '.يحب ان يكون حقل رقم الهوية ارقام',
            'unique' => '.قيمة حقل رقم الهوية مستخدمة من قبل',
        ],
        'birthdate' => [
            'required' => '.حقل تاريخ الميلاد مطلوب',
            'string' => '.يحب ان يكون حقل تاريخ الميلاد نصًا',
        ],
        'tax_number' => [
            'required_without' => '. حقل الرقم الضريبي مطلوب طالما لا يتوفر ملف تفويض',
            'string' => '.يحب ان يكون حقل الرقم الضريبي نصًا',
            'max' => '.يجب أن لا يتجاوز طول نّص حقل الرقم الضريبي عن :max حرف',
            'unique' => '.قيمة حقل الرقم الضريبي مستخدمة من قبل',
        ],
        'commercial_registration_number' => [
            'required_without' => '. حقل رقم السجل التجاري مطلوب طالما لا يتوفر ملف تفويض',
            'string' => '.يحب ان يكون حقل رقم السجل التجاري نصًا',
            'max' => '.يجب أن لا يتجاوز طول نّص حقل رقم السجل التجاري عن :max حرف',
            'unique' => '.قيمة حقل رقم السجل التجاري مستخدمة من قبل',
        ],
        'branch_id' => [
            'exists' => 'القيمة المحددة لحقل الفرع غير موجودة.',
        ],
        'delegation_file' => [
            'file' => 'حفل ملف التفويض يجب ان يكون ملفا',
            'mimes' => '. :values : يجب أن يكون ملفًا من نوع  ',
            'max' => ' يجب أن لا يتجاوز حجم ملف حقل ملف التفويض  :max كيلوبايت.',
        ],
        'user_type' => [
            'required' => '.حقل نوع الحساب مطلوب',
            'string' => '.يحب ان يكون حقل نوع الحساب نصًا',
            'in' => '.القيمة المختارة لحقل نوع الحساب غير موجودة',
        ],
    ],
];
