<?php

return [
    'validation' => [
        'company_id' => [
            'required' => '.حقل الشركة مطلوب',
            'integer' => '.يحب ان يكون حقل الشركة رقم',
            'exists' => '.القيمة المحددة لحقل الشركة غير موجودة',
        ],
        'branch_id' => [
            'required' => '.حقل الفرع مطلوب',
            'integer' => '.يحب ان يكون حقل الفرع رقم',
            'exists' => '.القيمة المحددة لحقل الفرع غير موجودة',
        ],
        'identification_number' => [
            'required' => '.حقل رقم الهوية مطلوب',
            'integer' => '.يحب ان يكون حقل رقم الهوية ارقام',
        ],
        'serial_number' => [
            'required' => '.حقل الرقم التسلسلي مطلوب',
            'integer' => '.يحب ان يكون حقل الرقم التسلسلي ارقام',
        ],
        'serial_code' => [
            'required' => '.حقل  الكود التسلسلي مطلوب',
            'integer' => '.يحب ان يكون حقل  الكود التسلسلي ارقام',
        ],
    ],
];
