<?php

return [
    'name' => [
        'required' => '.حقل اسم المدينة مطلوب',
        'array' => '.يحب ان يحتوي حقل اسم المدينة علي عنصر او اكثر',
        'ar' => [
            'required' => '.حقل اسم المدينة باللغة العربية مطلوب',
            'string' => '.يحب ان يكون حقل اسم المدينة باللغة العربية نصًا',
        ],
        'en' => [
            'required' => '.حقل اسم المدينة باللغة الانجليزية مطلوب',
            'string' => '.يحب ان يكون حقل اسم المدينة باللغة الانجليزية نصًا',
        ],
    ],
    "area_id" => [
        'required' => '.حقل المنطقة مطلوب',
        'exists' => 'القيمة المحددة لحقل المنطقة غير موجودة',
    ]
];
